In [8]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "Student": ["A","B","C","D","E"],
    "Math": [85,90,np.nan,70,88],
    "Physics": [np.nan,92,75,80,np.nan],
    "Attendance": [90,85,np.nan,95,88]
})

# Fill NaN with column means
df = df.fillna(df.mean(numeric_only=True))
print(df)

  Student   Math    Physics  Attendance
0       A  85.00  82.333333        90.0
1       B  90.00  92.000000        85.0
2       C  83.25  75.000000        89.5
3       D  70.00  80.000000        95.0
4       E  88.00  82.333333        88.0

In [11]:
# df.insert(2, "Chemistry", [i for i in np.random.randint(50,100,5)])
print(df)
df

  Student   Math  Chemistry    Physics  Attendance
0       A  85.00         67  82.333333        90.0
1       B  90.00         53  92.000000        85.0
2       C  83.25         77  75.000000        89.5
3       D  70.00         52  80.000000        95.0
4       E  88.00         80  82.333333        88.0

  Student   Math  Chemistry    Physics  Attendance
0       A  85.00         67  82.333333        90.0
1       B  90.00         53  92.000000        85.0
2       C  83.25         77  75.000000        89.5
3       D  70.00         52  80.000000        95.0
4       E  88.00         80  82.333333        88.0

In [ ]:
df.pop("Chemistry")

0    67
1    53
2    77
3    52
4    80
Name: Chemistry, dtype: int32

In [16]:
# del(df["Math"])
df

  Student    Physics  Attendance
0       A  82.333333        90.0
1       B  92.000000        85.0
2       C  75.000000        89.5
3       D  80.000000        95.0
4       E  82.333333        88.0